In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.max_columns", 200)
pd.set_option("display.max_colwidth", 200)

/Users/lisakim/.pyenv/versions/3.8.2/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
!ls

2021_PPP_Data
Adrian_Suggestion.docx
BK_NYC_B.csv
BK_NYC_BWBE.csv
BK_NYC_MktSize_Employment_2019.csv
BK_PPP_NYC_Firstdraw.csv
BogyungKim_PPP_Article.docx
ContactList.docx
CwgNP-ppp-borrowers-by-ethnicity-and-race-in-nyc (2).png
InterviewRecording_Jacqueline.m4a
InterviewRecording_Ron.m4a
InterviewTranscript_RonBusby.docx
Interview_RonBusby.docx
M_WBE__LBE__and_EBE_Certified_Business_List.csv
NYC_qcew2019_version1.ipynb
New York 0808
NewYorkFirstPPP.ipynb
PPP Data 150k plus 080820.csv
PPP Data up to 150k 080820 NY.csv
PPP_Firstdraw.csv
PPP_Gender.png
PPP_info.xlsx
QdFUg-avg-amount-of-loan-per-borrower-by-race.png
RnTUb-min-max-amount-issued-by-top-lenders.png
Screen Shot 2021-02-18 at 4.34.14 AM.png
Untitled.ipynb
aH5cs-lenders-that-issued-ppp-to-black-borrowers-in-nyc.png
aH5cs-lenders-that-issued-ppp-to-white-borrowers-in-nyc.png
aisqf-ppp-loans-approved-by-industry-in-nyc (1).png
all 56 states, territories, and the District of Columbia.
eQT40-number-of-loans-issued-in-nyc-by-lender.png
qcew
qcew_2019annual.csv
qcew_NYC2019.csv
sbs_certified_businesses.xls

## CSV file containing PPP Data up to $150K borrowed in New York State

In [3]:
df = pd.read_csv("PPP Data up to 150k 080820 NY.csv")

In [4]:
df.head()

,LoanAmount,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
0,149990.0,STATEN ISLAND,NY,10309.0,238340.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,8.0,05/01/2020,"JPMorgan Chase Bank, National Association",NY-11
1,149990.0,WHITESTONE,NY,11357.0,621210.0,Corporation,Unanswered,Male Owned,Non-Veteran,NaN,16.0,04/29/2020,"JPMorgan Chase Bank, National Association",NY-03
2,149987.0,BROOKLYN,NY,11205.0,484110.0,Corporation,Asian,Male Owned,Non-Veteran,NaN,13.0,04/28/2020,East West Bank,NY-08
3,149982.0,ISLIP TERRACE,NY,11752.0,236115.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,8.0,05/01/2020,"JPMorgan Chase Bank, National Association",NY-02
4,149979.0,NEW YORK,NY,10005.0,541840.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,11.0,05/01/2020,Haddon Savings Bank,NY-10

In [5]:
df.shape

(301795, 14)

In [6]:
df.dtypes

LoanAmount       float64
City              object
State             object
Zip              float64
NAICSCode        float64
BusinessType      object
RaceEthnicity     object
Gender            object
Veteran           object
NonProfit         object
JobsReported     float64
DateApproved      object
Lender            object
CD                object
dtype: object

## CSV file containing data on $150K plus loans approved

In [7]:
df2 = pd.read_csv("PPP Data 150k plus 080820.csv")
df2.head(2)

,LoanRange,BusinessName,Address,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
0,"d $350,000-1 million",AERO BOX LLC,NaN,NaN,NaN,NaN,484210.0,NaN,Unanswered,Unanswered,Unanswered,NaN,NaN,05/03/2020,The Huntington National Bank,NaN
1,"d $350,000-1 million",BOYER CHILDREN'S CLINIC,1850 BOYER AVE E,SEATTLE,NaN,98112.0,NaN,Non-Profit Organization,Unanswered,Unanswered,Unanswered,Y,75.0,05/03/2020,"Bank of America, National Association",WA-07

In [8]:
df2.shape

(662515, 16)

### Narrowing down data to New York State

In [9]:
df2 = df2[df2['CD'].str.contains("NY", na=False)]
df2.head(2)

,LoanRange,BusinessName,Address,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
416141,a $5-10 million,1186 BROADWAY RESTAURANT LLC,30 W 26th Street Floor 12,NEW YORK,NY,10010.0,721110.0,Limited Liability Company(LLC),Unanswered,Unanswered,Unanswered,NaN,417.0,04/15/2020,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,"2012 USP HOLDINGS, INC.",570 Elmont Road,Elmont,NY,11003.0,511120.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,500.0,04/15/2020,Manufacturers and Traders Trust Company,NY-04

In [10]:
df2.shape

(47065, 16)

## Merging df and df2

#### Organizing df and df2 before merging the two

In [11]:
df2.head(2)

,LoanRange,BusinessName,Address,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
416141,a $5-10 million,1186 BROADWAY RESTAURANT LLC,30 W 26th Street Floor 12,NEW YORK,NY,10010.0,721110.0,Limited Liability Company(LLC),Unanswered,Unanswered,Unanswered,NaN,417.0,04/15/2020,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,"2012 USP HOLDINGS, INC.",570 Elmont Road,Elmont,NY,11003.0,511120.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,500.0,04/15/2020,Manufacturers and Traders Trust Company,NY-04

In [12]:
df2 = df2[['LoanRange', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]
df2.head(2)

,LoanRange,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416141,a $5-10 million,10010.0,721110.0,NEW YORK,Limited Liability Company(LLC),Unanswered,Unanswered,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,11003.0,511120.0,Elmont,Subchapter S Corporation,Unanswered,Unanswered,Manufacturers and Traders Trust Company,NY-04

In [13]:
df2.rename(columns={'LoanRange':'LoanAmount'}, inplace=True)

In [14]:
df2.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416141,a $5-10 million,10010.0,721110.0,NEW YORK,Limited Liability Company(LLC),Unanswered,Unanswered,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,11003.0,511120.0,Elmont,Subchapter S Corporation,Unanswered,Unanswered,Manufacturers and Traders Trust Company,NY-04

In [15]:
df = df[['LoanAmount', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]
df.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
0,149990.0,10309.0,238340.0,STATEN ISLAND,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-11
1,149990.0,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03

#### Merging the two dataframes

In [16]:
df_Joined = pd.concat([df, df2])
df_Joined.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
0,149990,10309.0,238340.0,STATEN ISLAND,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-11
1,149990,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03

In [17]:
df_Joined.shape

(348860, 9)

## Narrowing df_Joined to New York City

In [18]:
# NY - 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16

In [19]:
# Kings and Queens, the two westernmost counties, are also boroughs of New York City.
df_Joined1 = df_Joined[df_Joined.CD == 'NY-03']

df_Joined3 = df_Joined[df_Joined.CD == 'NY-05']
#Most of the district is in Queens, but a small portion is located in Nassau County. 

df_Joined4 = df_Joined[df_Joined.CD == 'NY-06']
df_Joined5 = df_Joined[df_Joined.CD == 'NY-08']
df_Joined6 = df_Joined[df_Joined.CD == 'NY-10']
df_Joined7 = df_Joined[df_Joined.CD == 'NY-11']
df_Joined8 = df_Joined[df_Joined.CD == 'NY-12']
df_Joined9 = df_Joined[df_Joined.CD == 'NY-13']
df_Joined10 = df_Joined[df_Joined.CD == 'NY-14']
df_Joined11 = df_Joined[df_Joined.CD == 'NY-15']
df_Joined12 = df_Joined[df_Joined.CD == 'NY-16']
df_Joined13 = df_Joined[df_Joined.CD == 'NY-09']
df_Joined15 = df_Joined[df_Joined.CD == 'NY-07']

In [20]:
df_JoinedFinal = pd.concat([df_Joined1,df_Joined3,df_Joined4,df_Joined5,df_Joined6,df_Joined7,df_Joined8,df_Joined9,df_Joined10,df_Joined11,df_Joined12, df_Joined13, df_Joined15])
df_JoinedFinal

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
1,149990,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03
13,149938,11753.0,721110.0,Jericho,Limited Liability Company(LLC),Asian,Male Owned,"KEB Hana Bank USA, National Association",NY-03
25,149900,11021.0,541211.0,Great Neck,Limited Liability Company(LLC),Unanswered,Unanswered,Sterling National Bank,NY-03
34,149872,11714.0,999990.0,BETHPAGE,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
71,149700,11023.0,813110.0,Great Neck,Professional Association,Unanswered,Unanswered,Sterling National Bank,NY-03
...,...,...,...,...,...,...,...,...,...
463115,"e $150,000-350,000",11416.0,236115.0,OZONE PARK,Corporation,Unanswered,Unanswered,Valley National Bank,NY-07
463150,"e $150,000-350,000",11231.0,425120.0,Brooklyn,Corporation,Unanswered,Unanswered,First Republic Bank,NY-07
463155,"e $150,000-350,000",11201.0,236115.0,brooklyn,Limited Liability Company(LLC),Unanswered,Unanswered,Cross River Bank,NY-07
463191,"e $150,000-350,000",11232.0,238220.0,Brooklyn,Corporation,Unanswered,Female Owned,Manufacturers and Traders Trust Company,NY-07
463203,"e $150,000-350,000",11220.0,453998.0,BROOKLYN,Corporation,Unanswered,Unanswered,"Citibank, N.A.",NY-07

In [21]:
df_JoinedFinal.to_csv('PPP_Firstdraw.csv', index=False)

### Adding a column for maximum possible loan amount

In [22]:
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['LoanAmount']

In [23]:
df_JoinedFinal = df_JoinedFinal[['LoanAmount', 'Max_LoanAmount', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]

# Cleaning min. and max. approved loan

### replacing minimum amount with numbers

In [24]:
df_JoinedFinal = df_JoinedFinal.rename(columns={"LoanAmount": "Min_LoanAmount"})

df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('a $5-10 million', 5000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('b $2-5 million', 2000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('c $1-2 million', 1000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('d $350,000-1 million', 350000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('e $150,000-350,000', 150000)

### replacing maximum amount with numbers

In [25]:
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('a $5-10 million', 10000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('b $2-5 million', 5000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('c $1-2 million', 2000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('d $350,000-1 million', 1000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('e $150,000-350,000', 350000)

## Analyzing df_MinLoanAmount

In [26]:
df_JoinedFinal.shape

(185629, 10)

In [27]:
df_JoinedFinal.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
1,149990.00,149990.00,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03
13,149938.15,149938.15,11753.0,721110.0,Jericho,Limited Liability Company(LLC),Asian,Male Owned,"KEB Hana Bank USA, National Association",NY-03

In [28]:
df_JoinedFinal['NAICSCode'].value_counts(dropna=False).head(7)
# 722511 - Restaurant industry
# 621111 - Doctor's offices
# 541110 - Law firms
# 999990 - Unclassified Establishments
# 812990 - personal services (X include pet care services, laundry etc)
# 531210 - Offices of real estate agents and brokers

NaN         10034
722511.0     6655
621111.0     5726
541110.0     5360
999990.0     4791
812990.0     4361
531210.0     3745
Name: NAICSCode, dtype: int64

In [29]:
df_JoinedFinal[df_JoinedFinal.NAICSCode == 621610]

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
15975,107210.0,107210.0,11753.0,621610.0,Jericho,Limited Liability Company(LLC),Unanswered,Unanswered,WebBank,NY-03
19074,101225.0,101225.0,11023.0,621610.0,GREAT NECK,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
41763,70000.0,70000.0,11021.0,621610.0,GREAT NECK,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
109430,29166.0,29166.0,11791.0,621610.0,Jackson Heights,Limited Liability Company(LLC),Unanswered,Unanswered,"Kabbage, Inc.",NY-03
118989,25862.0,25862.0,11023.0,621610.0,GREAT NECK,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
...,...,...,...,...,...,...,...,...,...,...
433169,350000.0,1000000.0,11220.0,621610.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"Citibank, N.A.",NY-07
433170,350000.0,1000000.0,11220.0,621610.0,BROOKLYN,Corporation,Unanswered,Unanswered,"Citibank, N.A.",NY-07
445194,150000.0,350000.0,11220.0,621610.0,BROOKLYN,Corporation,Unanswered,Unanswered,"Citibank, N.A.",NY-07
448591,150000.0,350000.0,11220.0,621610.0,BROOKLYN,Non-Profit Organization,Unanswered,Unanswered,"TD Bank, National Association",NY-07
451837,150000.0,350000.0,11206.0,621610.0,BROOKLYN,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07

In [30]:
# mode of 722511

restaurant = df_JoinedFinal[df_JoinedFinal.NAICSCode == 722511.0]

In [31]:
restaurant.Min_LoanAmount.mode()

0    150000.0
dtype: float64

In [32]:
restaurant.Max_LoanAmount.mode()

0    350000.0
dtype: float64

In [33]:
# mean of 722511

In [34]:
restaurant.Min_LoanAmount.mean()

113865.16796694214

In [35]:
restaurant.Max_LoanAmount.mean()

230807.31672727273

In [36]:
# total restuarant min loan

In [37]:
restaurant.Min_LoanAmount.sum()

757772692.8199999

In [38]:
# restaurant sum
restaurant.Max_LoanAmount.sum()

1536022692.82

In [39]:
restaurant[restaurant.Min_LoanAmount >149000]
# 25.6%

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
418808,1000000.0,2000000.0,11743.0,722511.0,HUNTINGTON,Limited Liability Company(LLC),Unanswered,Unanswered,"TD Bank, National Association",NY-03
420814,1000000.0,2000000.0,11797.0,722511.0,WOODBURY,Limited Liability Company(LLC),Unanswered,Unanswered,Dime Community Bank,NY-03
422611,350000.0,1000000.0,11050.0,722511.0,PORT WASHINGTON,Limited Liability Company(LLC),Unanswered,Unanswered,"TD Bank, National Association",NY-03
422823,350000.0,1000000.0,11768.0,722511.0,NORTHPORT,Limited Liability Company(LLC),Unanswered,Unanswered,The First National Bank of Long Island,NY-03
423009,350000.0,1000000.0,11753.0,722511.0,Jericho,Subchapter S Corporation,Unanswered,Unanswered,Solera National Bank,NY-03
...,...,...,...,...,...,...,...,...,...,...
459680,150000.0,350000.0,11201.0,722511.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,Idaho First Bank,NY-07
459796,150000.0,350000.0,11237.0,722511.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
461502,150000.0,350000.0,11237.0,722511.0,BROOKLYN,Corporation,White,Male Owned,Brooklyn Cooperative FCU,NY-07
461939,150000.0,350000.0,11215.0,722511.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
462082,150000.0,350000.0,11201.0,722511.0,Brooklyn,Corporation,Unanswered,Unanswered,Customers Bank,NY-07

In [40]:
#restaurant[restaurant.Max_LoanAmount >149000]

In [41]:
# mode of 621111.0 doctor's offices

doctors = df_JoinedFinal[df_JoinedFinal.NAICSCode == 621111.0]

In [42]:
doctors.Min_LoanAmount.mode()

0    150000.0
dtype: float64

In [43]:
doctors.Max_LoanAmount.mode()

0    350000.0
dtype: float64

In [44]:
# mean of doctor's offices

In [45]:
doctors.Min_LoanAmount.mean()

70506.96617883339

In [46]:
doctors.Max_LoanAmount.mean()

118952.65252183023

In [47]:
# sum of doctors loan
doctors.Min_LoanAmount.sum()

403722888.34

In [48]:
doctors.Max_LoanAmount.sum()

681122888.3399999

In [49]:
doctors[doctors.Min_LoanAmount >149000]
# 12.3%

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416824,2000000.0,5000000.0,11803.0,621111.0,PLAINVIEW,Limited Liability Company(LLC),Unanswered,Unanswered,"TD Bank, National Association",NY-03
417157,2000000.0,5000000.0,11803.0,621111.0,PLAINVIEW,Corporation,Unanswered,Unanswered,BNB Bank,NY-03
421043,1000000.0,2000000.0,11576.0,621111.0,ROSLYN,Subchapter S Corporation,Unanswered,Unanswered,Signature Bank,NY-03
421189,1000000.0,2000000.0,11021.0,621111.0,Great Neck,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
422054,1000000.0,2000000.0,11803.0,621111.0,PLAINVIEW,Partnership,Unanswered,Unanswered,The First National Bank of Long Island,NY-03
...,...,...,...,...,...,...,...,...,...,...
454070,150000.0,350000.0,11215.0,621111.0,BROOKLYN,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
455253,150000.0,350000.0,11231.0,621111.0,Brooklyn,NaN,Unanswered,Unanswered,"Citibank, N.A.",NY-07
455254,150000.0,350000.0,11231.0,621111.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"Citibank, N.A.",NY-07
458887,150000.0,350000.0,11220.0,621111.0,BROOKLYN,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
462703,150000.0,350000.0,11206.0,621111.0,BROOKLYN,Corporation,Unanswered,Unanswered,First Horizon Bank,NY-07

In [50]:
#doctors[doctors.Max_LoanAmount >149000]

In [51]:
# 541110 - Law firms

In [52]:
lawfirms = df_JoinedFinal[df_JoinedFinal.NAICSCode == 541110.0]

In [53]:
lawfirms.Min_LoanAmount.mode()

0    150000.0
dtype: float64

In [54]:
lawfirms.Max_LoanAmount.mode()

0    350000.0
dtype: float64

In [55]:
lawfirms.Min_LoanAmount.mean()

97713.98156529851

In [56]:
lawfirms.Max_LoanAmount.mean()

192163.60843097017

In [57]:
lawfirms.Min_LoanAmount.sum()

523746941.19000006

In [58]:
lawfirms[lawfirms.Min_LoanAmount >149000]
# 14.6 %

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416637,2000000.0,5000000.0,11042.0,541110.0,LAKE SUCCESS,Limited Liability Partnership,Unanswered,Unanswered,ConnectOne Bank,NY-03
416666,2000000.0,5000000.0,11507.0,541110.0,ALBERTSON,Partnership,Unanswered,Unanswered,Signature Bank,NY-03
417313,2000000.0,5000000.0,11021.0,541110.0,Great Neck,Subchapter S Corporation,Unanswered,Unanswered,"Citibank, N.A.",NY-03
417583,2000000.0,5000000.0,11797.0,541110.0,WOODBURY,Limited Liability Partnership,Unanswered,Unanswered,BNB Bank,NY-03
417780,2000000.0,5000000.0,11797.0,541110.0,WOODBURY,Limited Liability Partnership,Unanswered,Unanswered,"TD Bank, National Association",NY-03
...,...,...,...,...,...,...,...,...,...,...
450691,150000.0,350000.0,11241.0,541110.0,Brooklyn,Corporation,Unanswered,Unanswered,Cross River Bank,NY-07
456940,150000.0,350000.0,11242.0,541110.0,BROOKLYN,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-07
458463,150000.0,350000.0,11242.0,541110.0,BROOKLYN,Partnership,Unanswered,Unanswered,Signature Bank,NY-07
459821,150000.0,350000.0,11206.0,541110.0,BROOKLYN,Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
462469,150000.0,350000.0,11242.0,541110.0,BROOKLYN,Limited Liability Partnership,Unanswered,Unanswered,Signature Bank,NY-07

In [59]:
#lawfirms[lawfirms.Max_LoanAmount >149000]

In [60]:
# unknown -- 999990.0 / 5221 businesses

In [61]:
unknown = df_JoinedFinal[df_JoinedFinal.NAICSCode == 999990.0]

In [62]:
unknown[unknown.Min_LoanAmount >149000]
#7%

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
34,149872.0,149872.0,11714.0,999990.0,BETHPAGE,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
425999,350000.0,1000000.0,11030.0,999990.0,Manhasset,NaN,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
426575,350000.0,1000000.0,11731.0,999990.0,East Northport,Corporation,Unanswered,Male Owned,"Bank of America, National Association",NY-03
431840,350000.0,1000000.0,11801.0,999990.0,Hicksville,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
435731,350000.0,1000000.0,11797.0,999990.0,WOODBURY,Subchapter S Corporation,Unanswered,Female Owned,"JPMorgan Chase Bank, National Association",NY-03
...,...,...,...,...,...,...,...,...,...,...
454530,150000.0,350000.0,11201.0,999990.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-07
457556,150000.0,350000.0,11215.0,999990.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-07
457834,150000.0,350000.0,11231.0,999990.0,BROOKLYN,Limited Liability Company(LLC),Unanswered,Unanswered,"Capital Bank, National Association",NY-07
462754,150000.0,350000.0,11220.0,999990.0,BROOKLYN,Corporation,Asian,Male Owned,Cathay Bank,NY-07
463078,150000.0,350000.0,11220.0,999990.0,Brooklyn,Corporation,Unanswered,Unanswered,Celtic Bank Corporation,NY-07

In [63]:
df_JoinedFinal['RaceEthnicity'].value_counts(dropna=False)
# number of Hispanic + Black/African Americans who received PPP checks

Unanswered                          176216
White                                 4479
Asian                                 3042
Hispanic                              1384
Black or African American              475
American Indian or Alaska Native        30
Puerto Rican                             3
Name: RaceEthnicity, dtype: int64

In [64]:
White_Lenders = df_JoinedFinal[df_JoinedFinal.RaceEthnicity == "White"]
White_Lenders.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
810,147055.2,147055.2,11050.0,541940.0,PORT WASHINGTON,Limited Liability Company(LLC),White,Male Owned,Dime Community Bank,NY-03
896,146741.9,146741.9,11042.0,713940.0,New Hyde Park,Subchapter S Corporation,White,Female Owned,Dime Community Bank,NY-03

In [65]:
White_Lenders.Lender.value_counts(dropna=False)

City National Bank                           696
Dime Community Bank                          531
Savoy Bank                                   289
JPMorgan Chase Bank, National Association    223
TD Bank, National Association                196
                                            ...
First Dakota National Bank                     1
The First National Bank of Ottawa              1
State Bank of Easton                           1
Affinity FCU                                   1
Western Union Company                          1
Name: Lender, Length: 279, dtype: int64

In [66]:
White_Lenders.Min_LoanAmount.mean()

141710.43812681403

In [67]:
White_Lenders.Max_LoanAmount.mean()

291241.58347175707

In [68]:
Black_Lenders = df_JoinedFinal[df_JoinedFinal.RaceEthnicity == "Black or African American"]
Black_Lenders.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
34794,78100.0,78100.0,11797.0,515111.0,WOODBURY,Corporation,Black or African American,Male Owned,City National Bank,NY-03
139633,20833.0,20833.0,11568.0,551111.0,OLD WESTBURY,Corporation,Black or African American,Male Owned,"Bank of America, National Association",NY-03

In [69]:
Black_Lenders.Lender.value_counts(dropna=False)

Dime Community Bank                                  70
City National Bank                                   63
Accion East, Inc.                                    36
Grow America Fund, Incorporated                      22
TruFund Financial Services Inc                       18
                                                     ..
DR Bank                                               1
Truist Bank d/b/a Branch Banking & Trust Co           1
Winthrop-University Hospital Empl FCU                 1
Empire Financial FCU                                  1
United Midwest Savings Bank, National Association     1
Name: Lender, Length: 75, dtype: int64

In [70]:
Black_Lenders.Min_LoanAmount.mean()

68826.20637894738

In [71]:
Black_Lenders.Max_LoanAmount.mean()

128931.46953684211

In [72]:
# refer to women-owned businesses 
# https://www.census.gov/quickfacts/fact/table/newyorkcitynewyork/PST040219

df_JoinedFinal['Gender'].value_counts(dropna=False)

Unanswered      161749
Male Owned       18505
Female Owned      5375
Name: Gender, dtype: int64

In [73]:
18505/236

78.41101694915254

In [74]:
df_JoinedFinal['CD'].value_counts(dropna=False)

NY-12    43620
NY-10    29174
NY-03    17040
NY-08    13154
NY-06    12715
NY-09    11738
NY-07    10855
NY-14    10701
NY-16     9881
NY-11     7767
NY-13     6517
NY-05     6384
NY-15     6083
Name: CD, dtype: int64

In [75]:
df_JoinedFinal['Lender'].value_counts(dropna=False).head(10)

JPMorgan Chase Bank, National Association    42277
Cross River Bank                             16507
Kabbage, Inc.                                16185
TD Bank, National Association                13741
Bank of America, National Association        11907
Citibank, N.A.                               10855
Celtic Bank Corporation                       8724
WebBank                                       5034
Signature Bank                                3887
Capital One, National Association             3262
Name: Lender, dtype: int64

In [76]:
JPMorgan = df_JoinedFinal[df_JoinedFinal.Lender == 'JPMorgan Chase Bank, National Association']
JPMorgan.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
1,149990.0,149990.0,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03
34,149872.0,149872.0,11714.0,999990.0,BETHPAGE,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03

In [77]:
JPMorgan.Min_LoanAmount.sum()

3974511218.1299996

In [78]:
JPMorgan.Max_LoanAmount.sum()

7629561218.13

In [79]:
CrossRiverBank = df_JoinedFinal[df_JoinedFinal.Lender == 'Cross River Bank']
CrossRiverBank.Min_LoanAmount.sum()

509275474.73999995

In [80]:
CrossRiverBank.Max_LoanAmount.sum()

748125474.7400001

In [81]:
Kabbage = df_JoinedFinal[df_JoinedFinal.Lender == 'Kabbage, Inc.']
Kabbage.Min_LoanAmount.sum()

280968472.36

In [82]:
Kabbage.Max_LoanAmount.sum()

344718472.36

In [83]:
TDBank = df_JoinedFinal[df_JoinedFinal.Lender == 'TD Bank, National Association'] 
TDBank.Min_LoanAmount.sum()

1053932572.4300001

In [84]:
TDBank.Max_LoanAmount.sum()

1989182572.4299998

In [85]:
BOA = df_JoinedFinal[df_JoinedFinal.Lender == 'Bank of America, National Association']

In [86]:
BOA.Min_LoanAmount.sum()

899210442.6300001

In [87]:
BOA.Max_LoanAmount.sum()

1691760442.63

In [88]:
Citibank = df_JoinedFinal[df_JoinedFinal.Lender == 'Citibank, N.A.']

In [89]:
Citibank.Min_LoanAmount.sum()

961002908.34

In [90]:
Citibank.Max_LoanAmount.sum()

1806602908.3400002

In [91]:
Celtic = df_JoinedFinal[df_JoinedFinal.Lender == 'Celtic Bank Corporation']

In [92]:
Celtic.Min_LoanAmount.sum()

235063281.29

In [93]:
Celtic.Max_LoanAmount.sum()

329513281.29